#ifndef _ARRAY_H_
#define _ARRAY_H_

/***************************************************************************
* @berif Поиск в массиве. Линейный поиск O(n)
* 		 Время работы алгоритма: T = O(n)
*        Количество выделенной памяти: M = O(1)
* @param array - указатель на массив
*        size  - размер массива
*        itm   - искомый элемент
* @return индекс найденного элемента
****************************************************************************/
int find_item( const int *array, unsigned int size, int item );

/***************************************************************************
* @berif Поиск в массиве. Поиск максимума за O(n)
* 		 Время работы алгоритма: T = O(n)
*        Количество выделенной памяти: M = O(1)
* @param array - указатель на массив
*        size  - размер массива
*
* @return индекс минимального элемента
****************************************************************************/
int find_max( const int *array, unsigned int size );

#endif _ARRAY_H_